replacing diagram
